Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: When measuring the footprint of a Quarkus application, we measure https://en.wikipedia.org/wiki/Resident_set_size[Resident Set Size (RSS)] and not the JVM heap size which is only a small part of the overall problem. The JVM not only allocates native memory for heap (`-Xms`, `-Xmx`) but also structures required by the jvm to run your application. Depending on the JVM implementation, the total memory allocated for an application will include, but not limited to:
ja_jp: Quarkusアプリケーションのフットプリントを測定する際には、 link:https://en.wikipedia.org/wiki/Resident_set_size[Resident Set Size(RSS)] を測定します。JVMのヒープサイズではありません。JVMヒープサイズは全体的な問題のほんの一部です。JVMは、ヒープ用のネイティブメモリー( `-Xms` , `-Xmx` )を割り当てるだけでなく、アプリケーションを実行するためにjvmが必要とする構造体も割り当てます。JVMの実装に応じて、アプリケーションに割り当てられる総メモリーは、以下のものを含みますが、これに限りません。

source: When metrics are properly enabled, metric reports for all enabled metrics are available at the `/metrics` REST endpoint of your application.
ja_jp: メトリクスが適切に有効になっている場合には、有効になっているすべてのメトリクスのメトリクスレポートは、アプリケーションの `/metrics` REST エンドポイントで利用できます。

source: When metrics collection is disabled for a data source, all metric values are zero.
ja_jp: データソースのメトリクス収集が無効になっている場合、すべてのメトリクス値はゼロになります。

source: When multiple classes have the `picocli.CommandLine.Command` annotation, then one of them needs to be also annotated with `io.quarkus.picocli.runtime.annotations.TopCommand`. This can be overwritten with the `quarkus.picocli.top-command` property.
ja_jp: 複数のクラスが `picocli.CommandLine.Command` アノテーションを持つ場合、そのうちの 1 つに `io.quarkus.picocli.runtime.annotations.TopCommand` アノテーションを付ける必要があります。これは `quarkus.picocli.top-command` プロパティーで上書きすることができます。

source: When multiple classes or packages need to be specified via the `quarkus.native.additional-build-args` configuration property, the `,` symbol needs to be escaped. An example of this is the following:
ja_jp: `quarkus.native.additional-build-args` 設定プロパティーを介して複数のクラスやパッケージを指定する必要がある場合は、`,` シンボルをエスケープする必要があります。その例を以下に示します。

source: When multiple extensions are used in the same project, a Quarkus platform BOM ensures:
ja_jp: 同じプロジェクトで複数のエクステンションを使用する場合、QuarkusプラットフォームのBOMは以下を保証します。

source: When multiple pairs are configured, the selection of one of the configured pairs of certificates and private keys is based on Server Name Indication (SNI). The client sends the name of the server to which the client is attempting to connect, and the server selects the appropriate pair of certificates and private keys. To use this feature, ensure that xref:./tls-registry-reference.adoc#sni[SNI] is enabled on both the client and server.
ja_jp: 複数のペアが設定されている場合、設定された証明書と秘密鍵のペアの 1 つが、Server Name Indication (SNI) に基づいて選択されます。 クライアントは接続しようとしているサーバーの名前を送信し、サーバーは適切な証明書と秘密鍵のペアを選択します。 この機能を使用するには、クライアントとサーバーの両方で xref:./tls-registry-reference.adoc#sni[SNI] が有効になっていることを確認してください。

source: When multiple profiles are active, the rules for profile configuration are the same. If two profiles define the same configuration, then the last listed profile has priority. Consider:
ja_jp: 複数のプロファイルが有効な場合、プロファイル設定に関するルールは同じです。2つのプロファイルが同じ設定を定義している場合、最後にリストされたプロファイルが優先されます。と考えてください:

source: When multiple services are configured, you must specify the `quarkus.stork.<service-name>.service-registrar.type`:
ja_jp: 複数のサービスが設定されている場合は、 `quarkus.stork.<service-name>.service-registrar.type` を指定する必要があります。

source: When named datasources are used, the `@FlywayDataSource` annotation can be used to specify the datasource to which the customizer applies. For example, if there are multiple datasources one of which is called `users` and customization of Flyway is needed for only that datasource, then the following code can be used:
ja_jp: 名前付きデータソースを使用する場合、 `@FlywayDataSource` アノテーションを使用して、カスタマイザーが適用されるデータソースを指定することができます。例えば、複数のデータソースがあり、そのうちの1つが `users` という名前で、そのデータソースに対してのみ Flyway のカスタマイズが必要な場合、以下のコードを使用することができます:

source: When no CDI scope is specified, the converter/listener will behave as if it was `@Dependent` and will be instantiated once per persistence unit it's used in.
ja_jp: CDI スコープが指定されていない場合、コンバーター/リスナーは `@Dependent` であるかのように振る舞い、使用される永続化ユニットごとに 1 回インスタンス化されます。

source: When no deserialization failure handler is set and a deserialization failure happens, report the failure and mark the application as unhealthy. If set to `false` and a deserialization failure happens, a `null` value is forwarded. Type: _boolean_
ja_jp: デシリアライズ失敗ハンドラーが設定されておらず、デシリアライズ失敗が発生した場合は、失敗を報告し、アプリケーションを異常としてマークします。 `false` に設定され、逆シリアル化の失敗が発生した場合、 `null` 値が転送されます。 Type: _boolean_

source: When no properties are set, Quarkus can typically infer everything it needs to set up Hibernate Reactive and will have it use the default datasource.
ja_jp: プロパティが設定されていない場合、Quarkusは通常、Hibernate Reactiveのセットアップに必要なすべてを推測し、デフォルトのデータソースを使用するようにします。

source: When no properties are set, Quarkus can typically infer everything it needs to setup Hibernate Reactive and will have it use the default datasource.
ja_jp: プロパティが設定されていない場合、Quarkusは通常、Hibernate Reactiveのセットアップに必要なすべてを推測し、デフォルトのデータソースを使用するようにします。

source: When no property is set, Quarkus can typically infer everything it needs to set up Hibernate ORM and will have it use the default datasource.
ja_jp: プロパティーが設定されていない場合、Quarkusは通常はHibernate ORMのセットアップに必要な値を推測し、 デフォルトのデータソースを使用するようにします。

source: When no property is set, Quarkus can typically infer everything it needs to setup Hibernate ORM and will have it use the default datasource.
ja_jp: プロパティが設定されていない場合、Quarkusは通常、Hibernate ORMのセットアップに必要なすべてを推測し、 デフォルトのデータソースを使用できるようにします。

source: When no property is set, the Blaze-Persistence defaults apply.
ja_jp: プロパティーが設定されていない場合は、Blaze-Persistenceのデフォルトが適用されます。

source: When not running in dev or test mode, you will need to start your AMQP broker. You can follow the instructions from the https://activemq.apache.org/components/artemis/documentation/latest/using-server.html[Apache ActiveMQ Artemis website] or create a `docker-compose.yaml` file with the following content:
ja_jp: 開発モードまたはテストモードで実行していない場合は、AMQP ブローカーを起動する必要があります。 https://activemq.apache.org/components/artemis/documentation/latest/using-server.html[Apache ActiveMQ Artemis website] の指示に従うか、以下のコンテンツで `docker-compose.yaml` ファイルを作成することができます。

source: When not running in dev or test mode, you will need to start your Kafka broker. You can follow the instructions from the https://kafka.apache.org/quickstart[Apache Kafka website] or create a `docker-compose.yaml` file with the following content:
ja_jp: 開発モードまたはテストモードで実行していない場合は、Kafka ブローカーを起動する必要があります。 https://kafka.apache.org/quickstart[Apache Kafka Web サイト] に記載された手順に従うか、次の内容で `docker-compose.yaml` ファイルを作成できます。

source: When not running in dev or test mode, you will need to start your Pulsar broker. You can follow the instructions from the https://pulsar.apache.org/docs/3.0.x/getting-started-docker/[Run a standalone Pulsar cluster in Docker] or create a `docker-compose.yaml` file with the following content:
ja_jp: 開発モードまたはテストモードで実行していない場合は、Pulsar ブローカーを起動する必要があります。 https://pulsar.apache.org/docs/3.0.x/getting-started-docker/[docker でスタンドアロン Pulsar クラスターを実行する] の手順にを実行するか、次の内容の `docker-compose.yaml` ファイルを作成します。

source: When not running in dev or test mode, you will need to start your RabbitMQ broker. You can follow the instructions from the https://hub.docker.com/_/rabbitmq[RabbitMQ Docker website] or create a `docker-compose.yaml` file with the following content:
ja_jp: 開発モードやテストモードで実行していないときは、RabbitMQブローカーを起動する必要があります。 link:https://hub.docker.com/_/rabbitmq[RabbitMQ Dockerウェブサイト]の指示に従うか、以下の内容の `docker-compose.yaml` ファイルを作成します:

source: When not running in dev or test mode, you will need to start your own Kafka broker and Apicurio Registry. The easiest way to get them running is to use `docker-compose` to start the appropriate containers.
ja_jp: 開発モードまたはテストモードで実行していない場合は、独自の Kafka ブローカーと Apicurio Registry を起動する必要があります。そのための最も簡単な方法は、`docker-compose` を使用して適切なコンテナーを起動することです。

source: When not using Leyden, you load a gazillion classes. JAR files are opened anyway, that's _"fine"_. Well, depending on your definition of _"fine"_.
ja_jp: Leyden を使用しない場合、膨大な数のクラスをロードすることになります。 JAR ファイルはどうせ開かれるので、それは _"fine"_ とされます。 まあ、何をもって _"fine"_ とするかによりますが。

source: When observing the failure event, if the callback throws an exception, Mutiny propagates a `CompositeException` aggregating the original failure and the callback failure.
ja_jp: 失敗イベントを観測しているときに、コールバックが例外を投げると、Mutinyは元の失敗とコールバックの失敗を集約した `CompositeException` を伝播します。

source: When opting for supporting both extensions, the deployment module of the custom extension will usually depend on the SPI modules - `quarkus-jaxrs-spi-deployment`, `quarkus-resteasy-common-spi`, `quarkus-rest-spi-deployment`, while the runtime modules will have `optional` dependencies on the runtime modules of both RESTEasy flavors.
ja_jp: 両方のエクステンションをサポートすることを選択した場合、カスタムエクステンションのデプロイメントモジュールは通常、SPIモジュール - `quarkus-jaxrs-spi-deployment` , `quarkus-resteasy-common-spi` , `quarkus-rest-spi-deployment` に依存し、 ランタイムモジュールは両方のRESTEasy フレーバーのランタイムモジュールに `optional` 依存することになります。

source: When opting for supporting both extensions, the deployment module of the custom extension will usually depend on the SPI modules - `quarkus-jaxrs-spi-deployment`, `quarkus-resteasy-common-spi`, `quarkus-resteasy-reactive-spi-deployment`, while the runtime modules will have `optional` dependencies on the runtime modules of both RESTEasy flavors.
ja_jp: 両方のエクステンションをサポートすることを選択した場合、カスタムエクステンションのデプロイメントモジュールは通常、SPIモジュール - `quarkus-jaxrs-spi-deployment` , `quarkus-resteasy-common-spi` , `quarkus-resteasy-reactive-spi-deployment` に依存し、ランタイムモジュールは両方のRESTEasyフレーバーのランタイムモジュールに `optional` 依存することになります。

source: When parsing a template document the parser identifies all _tags_. A tag starts and ends with a curly bracket, e.g. `{foo}`. The content of a tag must start with:
ja_jp: テンプレート文書を解析する際、パーサーはすべての _tag_ を識別します。 タグは中括弧で始まり、中括弧で終わります (例: `{foo}`)。 タグの内容は以下で始まる必要があります。

source: When performing blocking I/O, the underlying OS thread wrapped by the Java platform thread is put in a wait queue and a context switch occurs to load a new thread context onto the CPU core. This operation takes time. Since virtual threads are managed by the JVM, no underlying OS thread is blocked when they perform a blocking operation. Their state is simply stored in the heap and another Virtual thread is executed on the same Java platform thread.
ja_jp: ブロッキングI/Oを実行する場合、JavaプラットフォームのスレッドにラップされたOSスレッドは待ち行列に入れられ、新しいスレッドコンテキストをCPUコアにロードするためにコンテキストスイッチが発生します。この操作には時間がかかります。仮想スレッドはJVMによって管理されるためブロッキング処理を実行してもOSスレッドがブロックされることはありません。その状態は単にヒープに格納され、別の仮想スレッドが同じJavaプラットフォームのスレッドで実行されます。

source: When performing blocking I/O, the underlying OS thread wrapped by the Java platform thread is put in a wait queue, and a context switch occurs to load a new thread context onto the CPU core. This operation takes time. Since the JVM manages virtual threads, no underlying OS thread is blocked when they perform a blocking operation. Their state is stored in the heap, and another virtual thread is executed on the same Java platform (carrier) thread.
ja_jp: ブロッキング I/O を実行するとき、Java プラットフォームのスレッドによってラップされた基礎となる OS スレッドは待ち行列に入れられ、新しいスレッドコンテキストを CPU コアにロードするためにコンテキストスイッチが発生します。 この操作には時間がかかります。JVM は仮想スレッドを管理するため、OS スレッドがブロッキング操作を実行しても、そのスレッドがブロックされることはありません。 それらの状態はヒープに格納され、別の仮想スレッドが同じ Java プラットフォーム (キャリアー) スレッド上で実行されます。

source: When proactive authentication is disabled, xref:security-authorize-web-endpoints-reference.adoc#standard-security-annotations[standard security annotations] used on CDI beans do not function on an I/O thread if a secured method that is not void synchronously returns a value. This limitation arises from the necessity for these methods to access `SecurityIdentity`.
ja_jp: プロアクティブ認証が無効になっている場合、void ではないセキュリティー保護されたメソッドが同期的に値を返すと、CDI Bean で使用される xref:security-authorize-web-endpoints-reference.adoc#standard-security-annotations[標準セキュリティーアノテーション] は I/O スレッドで機能しません。 この制限は、これらのメソッドが `SecurityIdentity` にアクセスする必要があることが原因です。

source: When processing a request requires interacting with a remote service, like an HTTP API or a database, it does not block the execution while waiting for the response. Instead, it schedules the I/O operation and attaches a continuation, i.e., the request processing remaining code. This continuation can be passed as a callback (a function invoked with the I/O outcome), or use more advanced constructs such as reactive programming or co-routines. Regardless of how the continuation is expressed, the essential aspect is the release of the I/O thread and, as a consequence, the fact that this thread can be used to process another request. When the scheduled I/O completes, the I/O thread executes the continuation, and the processing of the pending request continues.
ja_jp: リクエストの処理に、HTTP APIやデータベースなどのリモートサービスとのやりとりが必要な場合、レスポンスを待つ間に実行をブロックすることはありません。代わりに、I/O操作をスケジューリングし、リクエスト処理の残りのコードである継続を添付します。この継続は、コールバック（I/Oの結果とともに呼び出される関数）として渡すこともできますし、リアクティブプログラミングやコルーティンなどのより高度な構成を使用することもできます。継続をどのように表現するかに関わらず、重要な点はI/Oスレッドの解放であり、その結果、このスレッドを使って別のリクエストを処理することができるという事実です。スケジュールされたI/Oが完了すると、I/Oスレッドは継続を実行し、保留中のリクエストの処理は継続されます。

source: When processing messages, you can propagate incoming record key to the outgoing record.
ja_jp: メッセージを処理するときに、着信レコードキーを送信レコードに伝播できます。

source: When prompted to log in to a `Single Page Application` provided by `OpenID Connect Dev UI`, do the following steps:
ja_jp: `OpenID Connect Dev UI` によって提供される `Single Page Application` にログインするように求められたら、次の手順を実行します。

source: When prompted to log in to a `Single Page Application` provided by `OpenID Connect Dev UI`, do the following:
ja_jp: `OpenID Connect Dev UI` によって提供される `Single Page Application` にログインするように求められたら、次の手順を実行します。

source: When ready, create a release for real this time by simply removing the `-Djreleaser.dry.run` flag from the command line, then browse to your repository and look at the freshly created release.
ja_jp: 準備ができたら、今度はコマンド ラインから `-Djreleaser.dry.run` フラグを削除して実際にリリースを作成し、リポジトリを参照して新しく作成されたリリースを確認します。

source: When ready, create a release for real this time by simply removing the `-Djreleaser.dryrun` flag from the command line, then browse to your repository and look at the freshly created release.
ja_jp: 準備ができたら、コマンドラインから `-Djreleaser.dryrun` フラグを削除するだけで、今回は実際のリリースを作成し、リポジトリーを参照して、新しく作成されたリリースを確認します。

source: When receiving a `Multi`, the method is invoked once per connection, and the provided `Multi` receives the items transmitted by this connection. If the method returns a `Multi` (constructed from the received one), Quarkus will automatically subscribe to it and write the emitted items until completion, failure, or cancellation. However, if your method does not return a `Multi`, you must subscribe to the incoming `Multi` to consume the data.
ja_jp: `Multi` を受信すると、メソッドは接続ごとに 1 回呼び出され、提供された `Multi` はこの接続によって送信された項目を受信します。 メソッドが `Multi` (受信したものから構築) を返す場合、Quarkus は自動的にそれをサブスクライブし、完了、失敗、またはキャンセルされるまで、発行された項目を書き込みます。 ただし、メソッドが `Multi` を返さない場合は、データを使用するために受信した `Multi` をサブスクライブする必要があります。

source: When referencing beans using a string value in configuration properties, that string is parsed.
ja_jp: 設定プロパティーで文字列の値を使用してBeanを参照する場合、その文字列は解析されます。

source: When returning Mutiny types using RESTEasy Reactive, everything happens on the IO Thread (except if the endpoint is annotated with `@Blocking`). By the way, no need for an external extension to use Mutiny with RESTEasy Reactive, it’s built-in!
ja_jp: RESTEasy Reactive を使用して Mutiny 型を返す場合、すべての処理は IO スレッド上で行われます (エンドポイントが `@Blocking` でアノテーションされている場合を除く)。RESTEasy Reactive で Mutiny を使用するための外部エクステンションは不要です。

source: When returning a `Uni`, every _subscription_ invokes the remote service. It means you can re-send the request by re-subscribing on the `Uni`, or use a `retry` as follows:
ja_jp: `Uni` を返すとき、すべての _サブスクリプション_ は 、リモートサービスを呼び出します。つまり、 `Uni` で再購読してリクエストを再送信するか、以下のように `retry` を使用することができます。

source: When returning an object or a `Uni`, you can also use the `@Valid` annotation:
ja_jp: オブジェクトまたは `Uni` を返す場合、 `@Valid` アノテーションも使用できます。

source: When running a command mode application the basic lifecycle is as follows:
ja_jp: コマンドモードのアプリケーションを実行する場合、基本的なライフサイクルは以下の通りです:

source: When running a local application using the `999-SNAPSHOT` version, the Dev UI will show a `Dev UI` Log in the footer. This is useful for debugging all JSON RPC messages flowing between the browser and the Quarkus app.
ja_jp: `999-SNAPSHOT` バージョンを使用してローカルアプリケーションを実行すると、Dev UI のフッターに `Dev UI` Log が表示されます。これは、ブラウザーと Quarkus アプリ間でやり取りされるすべての JSON RPC メッセージをデバッグする場合に役立ちます。

source: When running a production application using the `fast-jar` package type (which is the default), almost all dependencies are loaded via the `io.quarkus.bootstrap.runner.RunnerClassLoader` which indexes class at build time, while a small set of dependencies is loaded from the system ClassLoader.
ja_jp: `fast-jar` パッケージタイプ (デフォルト) を使って本番アプリケーションを実行する場合、ほとんどすべての依存関係は、ビルド時にクラスをインデックスする `io.quarkus.bootstrap.runner.RunnerClassLoader` を介してロードされ、依存関係の小さなセットは、システムの ClassLoader からロードされます。

source: When running a production application using the `legacy-jar` package type everything is loaded in the system ClassLoader, so it is a completely flat classpath.
ja_jp: `legacy-jar` パッケージタイプを使用して本番アプリケーションを実行すると、すべてがシステム ClassLoader で読み込まれるため、完全にフラットなクラスパスとなります。

source: When running in Kubernetes, you can use Kubernetes secrets to store the keystores and truststores.
ja_jp: Kubernetes で実行する場合、Kubernetes シークレットを使用してキーストアとトラストストアを保存できます。

source: When running in Kubernetes, you can use cert-manager to generate and renew certificates automatically. Cert-manager produces a secret containing the keystores and truststores. Configuring the TLS registry is the same as when using Kubernetes secrets. The generated secret includes the following files:
ja_jp: Kubernetes で実行する場合、cert-manager を使用して証明書を自動的に生成および更新できます。 cert-manager は、キーストアとトラストストアが含まらえるシークレットを生成します。 TLS レジストリーの設定は、Kubernetes シークレットを使用する場合と同じです。 生成されたシークレットには次のファイルが含まれます。

source: When running in appropriately configured Kubernetes clusters, Kafka extension will pull its Kafka broker connection configuration from the service binding available inside the cluster, without the need for user configuration.
ja_jp: 適切に設定された Kubernetes クラスターで実行すると、Kafka エクステンションはユーザー設定を必要とせずに、クラスター内で利用可能なサービスバインディングから Kafka ブローカー接続設定を取得します。

source: When running in dev mode, Quarkus provides a dynamic, modular web interface accessible at http://localhost:8080/q/dev-ui. You can also click `d` in the console log, that will open your default browser at Dev UI.
ja_jp: 開発モードで実行している場合、Quarkus は http://localhost:8080/q/dev-ui でアクセスできる動的でモジュラーな Web インターフェースを提供します。コンソールログで `d` をクリックすると、デフォルトのブラウザーで Dev UI が開きます。

source: When running in native mode, the default behavior for GraalVM native executable generation is to only include the main "SUN" provider unless you have enabled SSL, in which case all security providers are registered. If you are not using SSL, then you can selectively register security providers by name using the `quarkus.security.security-providers` property. The following example illustrates configuration to register the "SunRsaSign" and "SunJCE" security providers:
ja_jp: ネイティブモードで実行している場合、GraalVMネイティブ実行可能ファイル生成のデフォルトの動作は、SSLを有効にしていない限り、メインの「SUN」プロバイダのみを含めるようになっています。SSLを有効にしている場合は、すべてのセキュリティープロバイダが登録されます。SSLを使用していない場合は、 `quarkus.security.security-providers` プロパティーを使用して、セキュリティープロバイダを名前で選択的に登録することができます。以下の例では、「SunRsaSign」と「SunJCE」のセキュリティープロバイダを登録するための設定を説明します。

source: When running tests this way, the only things that actually run natively are you application endpoints, which you can only test via HTTP calls. Your test code does not actually run natively, so if you are testing code that does not call your HTTP endpoints, it's probably not a good idea to run them as part of native tests.
ja_jp: この方法でテストを実行する場合、実際にネイティブで実行されるのはアプリケーションのエンドポイントのみで、HTTP 呼び出しでしかテストできません。テストコードは実際にはネイティブには実行されないので、HTTP エンドポイントを呼び出さないコードをテストしている場合は、ネイティブテストの一部として実行するのは良い考えではないでしょう。

source: When running tests this way, the only things that actually run natively are your application endpoints, which you can only test via HTTP calls. Your test code does not actually run natively, so if you are testing code that does not call your HTTP endpoints, it's probably not a good idea to run them as part of native tests.
ja_jp: この方法でテストを実行する場合、実際にネイティブで実行されるのはアプリケーションのエンドポイントのみで、HTTP 呼び出しでしかテストできません。テストコードは実際にはネイティブには実行されないので、HTTP エンドポイントを呼び出さないコードをテストしている場合は、それらをネイティブテストの一部として実行するのは良い考えではないでしょう。

source: When running the production version of the application, the Elasticsearch connection needs to be configured as normal, so if you want to include a production database config in your `application.properties` and continue to use Dev Services we recommend that you use the `%prod.` profile to define your Elasticsearch settings.
ja_jp: アプリケーションの本番環境版を実行する場合、Elasticsearch接続は通常通り設定する必要があります。したがって、 `application.properties` に本番環境版のデータベース設定を含め、Dev Servicesを引き続き使用したい場合は、 `%prod.` プロファイルを使用してElasticsearch設定を定義することをお勧めします。

source: When running the production version of the application, the Elasticsearch connection needs to be configured as usual, so if you want to include a production database config in your `application.properties` and continue to use Dev Services we recommend that you use the `%prod.` profile to define your Elasticsearch settings.
ja_jp: 製品版アプリケーションの実行時には、通常通りElasticsearch接続の設定が必要です。 `application.properties` に製品版データベース設定を含め、Dev Servicesを引き続き使用したい場合は、 `%prod.` プロファイルを使用してElasticsearch設定を定義することをお勧めします。

source: When running the production version of the application, the Infinispan connection need to be configured as normal, so if you want to include a production database config in your `application.properties` and continue to use Dev Services we recommend that you use the `%prod.` profile to define your Infinispan settings.
ja_jp: アプリケーションの実稼働バージョンを実行する場合、Infinispan接続は通常通り設定する必要があります。本番データベース設定を `application.properties` に含め、Dev Servicesを引き続き使用したい場合は、 `%prod.` プロファイルを使用してInfinispanの設定を定義することをお勧めします。

source: When running the production version of the application, the MongoDB connection need to be configured as normal, so if you want to include a production database config in your `application.properties` and continue to use Dev Services we recommend that you use the `%prod.` profile to define your MongoDB settings.
ja_jp: 本番環境のアプリケーションを実行する場合、MongoDBの接続は通常通りに設定する必要があります。本番環境のデータベースの設定を `application.properties` に含めてDev Servicesを継続して使用する場合は、 `%prod.` プロファイルを使用してMongoDBの設定を定義することをお勧めします。

source: When running the production version of the application, the Redis connection need to be configured as normal, so if you want to include a production database config in your `application.properties` and continue to use Dev Services we recommend that you use the `%prod.` profile to define your Redis settings.
ja_jp: アプリケーションの本番バージョンを実行するときは、Redis接続を通常どおりに構成する必要があるため、本番データベースの構成を `application.properties` に含めて、引き続きDev Servicesを使用する場合は、 `％ prod.` プロファイルを使用してRedis設定を定義することをお勧めします。

source: When running your application in JVM mode (so not compiled into native, for native check xref:native[the dedicated section]), you can follow the xref:./container-image.adoc[containerization guide] to build a container.
ja_jp: アプリケーションを JVM モードで実行する場合 (つまりネイティブにコンパイルしない場合、ネイティブについては xref:native[専用のセクション] を参照してください）、xref:./container-image.adoc[コンテナー化ガイド] に従ってコンテナーをビルドすることができます。
